In [1]:
import pandas as pd
import numpy as np

In [11]:
a=[10,'a',4.6]
mycol=pd.Series(a)
mycol

0     10
1      a
2    4.6
dtype: object

In [12]:
b=[15,16,17]
s=pd.Series(b,index=['a','b','c'])
print(s)
print(s['b'])
print(s[1])

a    15
b    16
c    17
dtype: int64
16
16

In [13]:
import numpy as np
data=np.array([5,6,7,8])
ds=pd.Series(data,index=[10,20,30,40])
ds

10    5
20    6
30    7
40    8
dtype: int32

In [2]:
d={1:("a",'A'),2:"b",3:"c",4:"d"}
ds=pd.Series(d)
ds1=pd.Series(d,index=[2,3,4,5])
print(ds)
print(ds1)
ds2=pd.Series(d,index=[1,2,3,4,5,1,2,3,4])
print(ds2)

1    (a, A)
2         b
3         c
4         d
dtype: object
2      b
3      c
4      d
5    NaN
dtype: object
1    (a, A)
2         b
3         c
4         d
5       NaN
1    (a, A)
2         b
3         c
4         d
dtype: object

In [15]:
ds=pd.Series(5,index=(1,2,3,4,5))
ds

1    5
2    5
3    5
4    5
5    5
dtype: int64

In [16]:
ds=pd.Series(np.ones(5),dtype=int)
print(ds)
ds1=pd.Series(np.arange(1,11))
print(ds1)

0    1
1    1
2    1
3    1
4    1
dtype: int32
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32

In [17]:
data={"name":["arpit",'aryan','akshat'],'Rollno.':[20,10,17],'Marks':[100,100,100]}
df=pd.DataFrame(data)
df

     name  Rollno.  Marks
0   arpit       20    100
1   aryan       10    100
2  akshat       17    100

In [18]:
data={"name":["arpit",'aryan','akshat'],'Rollno.':[20,10,17],'Marks':[100,100,100]}
df=pd.DataFrame(data,index=['st1','st2','st3'])
df

       name  Rollno.  Marks
st1   arpit       20    100
st2   aryan       10    100
st3  akshat       17    100

In [19]:
df.loc['st1']#perticular row access

name       arpit
Rollno.       20
Marks        100
Name: st1, dtype: object

In [20]:
df['name']
#df['str1'] it get key error not allowed

st1     arpit
st2     aryan
st3    akshat
Name: name, dtype: object

In [21]:
df.loc[['st1','st2']]

      name  Rollno.  Marks
st1  arpit       20    100
st2  aryan       10    100

In [10]:
n=np.array([['abc','xyz','pqr'],[1,2,3],['a','b','c']])
p=pd.DataFrame(n,columns=['ID1','ID2','ID3'],index=['NAME','ROLLNO','SEC'])
p

        ID1  ID2  ID3
NAME    abc  xyz  pqr
ROLLNO    1    2    3
SEC       a    b    c

In [11]:
n1=np.array([['arpit',20,'a'],['aryan',22,'b']])
p=pd.DataFrame(n1,columns=["name",'rollno.','sec'],index=[1,2])
p

    name rollno. sec
1  arpit      20   a
2  aryan      22   b

In [12]:
d={'name':n[0],'rollno':n[1],'sec':n[2]}
print(d)
df=pd.DataFrame(d,index=[1,2,3])
df

{'name': array(['abc', 'xyz', 'pqr'], dtype='<U11'), 'rollno': array(['1', '2', '3'], dtype='<U11'), 'sec': array(['a', 'b', 'c'], dtype='<U11')}

  name rollno sec
1  abc      1   a
2  xyz      2   b
3  pqr      3   c

In [8]:
#list of dictionary
ld=[{}]

In [26]:
s1=pd.Series({'NAME':'ARPIT','ROLL_NO':20,'MARKS':100})
s2=pd.Series({'NAME':'ARPIT','ROLL_NO':21,'MARKS':100})
s3=pd.Series({'NAME':'ARYAN','ROLL_NO':2,'MARKS':100})
p=pd.DataFrame([s1,s2,s3])
p

    NAME  ROLL_NO  MARKS
0  ARPIT       20    100
1  ARPIT       21    100
2  ARYAN        2    100

In [27]:
print(p.index)
print(p.values)
print(p.columns)
print(p['NAME'])
#insert operation
p['SECTION']=['A','B','C']
p

RangeIndex(start=0, stop=3, step=1)
[['ARPIT' 20 100]
 ['ARPIT' 21 100]
 ['ARYAN' 2 100]]
Index(['NAME', 'ROLL_NO', 'MARKS'], dtype='object')
0    ARPIT
1    ARPIT
2    ARYAN
Name: NAME, dtype: object

    NAME  ROLL_NO  MARKS SECTION
0  ARPIT       20    100       A
1  ARPIT       21    100       B
2  ARYAN        2    100       C

In [28]:
p.insert(1,'Sur_Name',['Jadon','Yadav','Jadon'])
p

    NAME Sur_Name  ROLL_NO  MARKS SECTION
0  ARPIT    Jadon       20    100       A
1  ARPIT    Yadav       21    100       B
2  ARYAN    Jadon        2    100       C

In [29]:
del p['SECTION']
p

    NAME Sur_Name  ROLL_NO  MARKS
0  ARPIT    Jadon       20    100
1  ARPIT    Yadav       21    100
2  ARYAN    Jadon        2    100

In [30]:
p.rename(columns={'NAME':'St_Name'})

  St_Name Sur_Name  ROLL_NO  MARKS
0   ARPIT    Jadon       20    100
1   ARPIT    Yadav       21    100
2   ARYAN    Jadon        2    100

In [22]:
dfr=pd.DataFrame(np.random.rand(50,5))
print(dfr.head())
#print(dfr)#it will print first and last five rows of DF
#print(dfr.to_string())#to_string method we can display complete DF
print(dfr.to_string())

          0         1         2         3         4
0  0.686281  0.532053  0.239377  0.953911  0.738676
1  0.773494  0.814865  0.860603  0.180259  0.860471
2  0.019056  0.451149  0.858639  0.504881  0.961590
3  0.012425  0.149549  0.830598  0.889651  0.161831
4  0.662493  0.109845  0.872705  0.628695  0.073788
           0         1         2         3         4
0   0.686281  0.532053  0.239377  0.953911  0.738676
1   0.773494  0.814865  0.860603  0.180259  0.860471
2   0.019056  0.451149  0.858639  0.504881  0.961590
3   0.012425  0.149549  0.830598  0.889651  0.161831
4   0.662493  0.109845  0.872705  0.628695  0.073788
5   0.689745  0.700060  0.162341  0.803696  0.230158
6   0.997437  0.634872  0.069424  0.584816  0.291422
7   0.334691  0.167850  0.691906  0.185790  0.852963
8   0.015005  0.494093  0.800774  0.391523  0.315416
9   0.557963  0.056808  0.584171  0.860262  0.589793
10  0.746736  0.374980  0.201147  0.241845  0.010658
11  0.361461  0.751001  0.118251  0.328881  0.702371
12  0.898506  0.222320  0.410004  0.412012  0.294735
13  0.861340  0.500117  0.621869  0.267005  0.467216
14  0.273557  0.647976  0.752622  0.287174  0.570994
15  0.889829  0.323392  0.696248  0.276632  0.450884
16  0.286458  0.768464  0.765095  0.295817  0.114678
17  0.528836  0.523733  0.748162  0.499145  0.622882
18  0.097090  0.948262  0.851035  0.396278  0.390802
19  0.612016  0.310640  0.095511  0.639522  0.386686
20  0.895135  0.665065  0.430375  0.296891  0.254836
21  0.927252  0.134489  0.340754  0.790008  0.729097
22  0.577392  0.275176  0.086855  0.700028  0.609732
23  0.967625  0.933174  0.833115  0.818601  0.125038
24  0.984131  0.780131  0.648543  0.054628  0.864862
25  0.687012  0.094989  0.533472  0.187228  0.947102
26  0.171039  0.982751  0.621386  0.568944  0.495124
27  0.650494  0.063392  0.379723  0.201896  0.028326
28  0.272841  0.099780  0.617772  0.671374  0.846268
29  0.144797  0.174651  0.349604  0.410575  0.627634
30  0.346183  0.577341  0.108336  0.016791  0.108834
31  0.602265  0.624722  0.467062  0.292621  0.396164
32  0.908268  0.738364  0.154018  0.522539  0.283306
33  0.554461  0.924376  0.147982  0.744473  0.915273
34  0.499124  0.312781  0.405270  0.990712  0.942184
35  0.626541  0.856308  0.957820  0.206506  0.188992
36  0.745397  0.357556  0.673775  0.346117  0.388891
37  0.898893  0.863573  0.084962  0.358182  0.615169
38  0.662797  0.732127  0.513960  0.367067  0.375220
39  0.353045  0.470439  0.960248  0.346299  0.522128
40  0.820540  0.166926  0.525125  0.298235  0.046843
41  0.262859  0.668895  0.632588  0.643154  0.132988
42  0.290748  0.036335  0.218181  0.897247  0.961496
43  0.645993  0.969494  0.453401  0.271714  0.710551
44  0.740693  0.180697  0.757795  0.612241  0.562994
45  0.539742  0.030365  0.742019  0.556042  0.549959
46  0.661223  0.056442  0.195113  0.639135  0.443896
47  0.984580  0.803478  0.416599  0.053039  0.125097
48  0.088639  0.550154  0.529469  0.806118  0.734503
49  0.071031  0.710257  0.034569  0.658304  0.168568

In [23]:
dfr.tail()#it will provide last five rows

           0         1         2         3         4
45  0.539742  0.030365  0.742019  0.556042  0.549959
46  0.661223  0.056442  0.195113  0.639135  0.443896
47  0.984580  0.803478  0.416599  0.053039  0.125097
48  0.088639  0.550154  0.529469  0.806118  0.734503
49  0.071031  0.710257  0.034569  0.658304  0.168568

In [32]:
p.loc[0,'MARKS']

100

In [33]:
p.loc[0]

NAME        ARPIT
Sur_Name    Jadon
ROLL_NO        20
MARKS         100
Name: 0, dtype: object

In [34]:
p

    NAME Sur_Name  ROLL_NO  MARKS
0  ARPIT    Jadon       20    100
1  ARPIT    Yadav       21    100
2  ARYAN    Jadon        2    100

In [35]:
print(p.iloc[1,2])

21

In [45]:
print(p.iloc[::-1,::-1])
print(p.iloc[0:2,1:3])

   MARKS  ROLL_NO Sur_Name   NAME
2    100        2    Jadon  ARYAN
1    100       21    Yadav  ARPIT
0    100       20    Jadon  ARPIT
  Sur_Name  ROLL_NO
0    Jadon       20
1    Yadav       21

In [46]:
p

    NAME Sur_Name  ROLL_NO  MARKS
0  ARPIT    Jadon       20    100
1  ARPIT    Yadav       21    100
2  ARYAN    Jadon        2    100

In [59]:
p.to_csv(r"C:\\Users\Arpit\Desktop\pandas\data1.csv")#"C:\/Users\Arpit\Desktop\pandas\data1.csv" ese bhi kar skte hai

In [60]:
p1=pd.read_csv("C:\/Users\Arpit\Desktop\pandas\data1.csv")
p1

   Unnamed: 0   NAME Sur_Name  ROLL_NO  MARKS
0           0  ARPIT    Jadon       20    100
1           1  ARPIT    Yadav       21    100
2           2  ARYAN    Jadon        2    100